{"_id":{"$oid":"6150e5136aff81185822af29"},"Title":"How do we go from here?","Description":"A brilliant ex-criminal who just came out of prison suddenly has to be a mom for her teenager niece.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Ralph Haugen","Bio":"Ralph Haugen is a Canadian film director, film producer, and screenwriter. Not only comedy movies, but he also directed several drama movies with background of families and friendship.","Birth":"1978"},"ImagePath":"howdowegofromhere.png","Featured":true}
{"_id":{"$oid":"6150ea796aff81185822af2a"},"Title":"Sweeping Heist","Description":"Jack has spent all of his efforts for this largest and last heist, but he must choose between forget about his dream or the world forget about him.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Hester Daly","Bio":"Hester Daly is a British director and screenwriter. He noted for action movies that combine violence with melodramatic depictions of human bonding.","Birth":"1981"},"ImagePath":"sweepingheist.png","Featured":true}
{"_id":{"$oid":"6150ea936aff81185822af2b"},"Title":"So you say, I am not a Human?","Description":"Two best friends went deep inside the forest to learn about their identities but only to found out that they are not even from Earth.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Amanda Kanazawa","Bio":"Amanda Kanazawa is a Japanese-American filmmaker. She directed mostly family-friendly fantasy movies since 2018.","Birth":"1985"},"ImagePath":"soyousayiamnothuman.png","Featured":true}
{"_id":{"$oid":"6150ead46aff81185822af2c"},"Title":"Get Revenged Co.","Description":"Welcome to Get Revenge Co., where we do the revenge for you and, of course, with a price.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images."},"Director":{"Name":"Lilly-Mai Salinas","Bio":"Lilly-Mai Salinas is an American storyboard artist and Director. She began her career in animation since 2001.","Birth":"1980"},"ImagePath":"getrevengedco.png","Featured":true}
{"_id":{"$oid":"6150feca6aff81185822af2e"},"Title":"Caramel Sky with Ice on the Bottom","Description":"Lauren never believes in extraterrestrial life until she picks up a random device that suddenly transport her to a caramel-sky and icy planet, Cyull.","Genre":{"Name":"Sci-Fi","Description":"Science fiction (sometimes shortened to sci-fi or SF) is a genre of speculative fiction that typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Remo Seelen","Bio":"Remo Seelen is an Italian-based filmmaker. His love for Sci-Fi leads him to create lots of popular Sci-Fi movies.","Birth":"1977"},"ImagePath":"caramelskyicebottom.png","Featured":true}
{"_id":{"$oid":"6150fee26aff81185822af2f"},"Title":"Gow's Daughter","Description":"Keith is a monster fuelled by rejection, who taunts teenagers and shaves them. Mr Gow, a graduate from Douglas, knows he has to stop him. In a brutal conclusion, the villain murders Gow's daughter.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Nathan Mclaughlin","Bio":"Nathan Mclaughlin is an Ireland-based filmmaker and screenwriter. He received an award for Best Screenwriter in 2000.","Birth":"1980"},"ImagePath":"gowsdaughter.png","Featured":true}
{"_id":{"$oid":"6150ff286aff81185822af30"},"Title":"Scorched Down","Description":"An underground terrorist group launchs a guerilla assault in every corner of earth. The surface of is scorched and everybody has to live underground. One simple man has no choice but to bring down the terrorist using a valuable pen. ","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Dominic Simpson","Bio":"Dominic Simpson is an American film director, screenwriter, and actor. He shoots, edits, produces, and scores many of his films in Mexico and in his home state of Texas.","Birth":"1975"},"ImagePath":"scorcheddown.png","Featured":true}
{"_id":{"$oid":"6150ff3f6aff81185822af31"},"Title":"Stop Subscribing, Please","Description":"Hana has a popular JustFan account and she keeps it secret from anyone. Who ever thought that Jeno, her famous classmate aka her long-standing crush, subscribes to her content.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Kyung-Mi Oh","Bio":"Kyung-Mi Oh is a South Korean film director, film producer, and screenwriter. Her works mainly focused on slice-of-life drama and she also produced few popular comedy film. She was nominated for AFA Best Film Director in 2018.","Birth":"1978"},"ImagePath":"stopsubscribingplease.png","Featured":false}
{"_id":{"$oid":"6150ff816aff81185822af32"},"Title":"Guild Reconciliation: To-Do List","Description":"Tatiana grew up in a world where mages and fighters guild never stand on a same page. As a fighter, her families dislike her friendship with a mage named Eldrie. One day, they make a big plan to trap these two guilds to work together.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Adde Shepherd","Bio":"Adde Shepherd is a British film director, producer and screenwriter. He directed the 2000 campaign for the Italian Connected fashion label","Birth":"1978"},"ImagePath":"grtodolist.png","Featured":true}
{"_id":{"$oid":"6152021039bf57c17a40d07b"},"Title":"Lessons About Genuine","Description":"A story of a girl who distrust literally everything and she was grouped with an unbelievably bubbly guy for her last assignment. She never thought that this was the turning point of her life.","Genre":{"Name":"Drama","Description":"Drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Kyung-Mi Oh","Bio":"Kyung-Mi Oh is a South Korean film director, film producer, and screenwriter. Her works mainly focused on slice-of-life drama and she also produced few popular comedy film. She was nominated for AFA Best Film Director in 2018.","Birth":"1978"},"ImagePath":"lessonsaboutgenuine.png","Featured":false}
